(function (_0x1f0a93, _0x5739e1) {
  const _0x1aac12 = _0x1f0a93();
  while (true) {
    try {
      const _0x4f0223 = parseInt(_0xfcb6(0x162, 0x3f)) / 0x1 * (-parseInt(_0xfcb6(0x254, 0x19a)) / 0x2) + parseInt(_0xfcb6(0x242, 0x1b9)) / 0x3 + parseInt(_0xfcb6(0x2f8, 0x256)) / 0x4 + -parseInt(_0xfcb6(0x239, 0x185)) / 0x5 * (-parseInt(_0xfcb6(0x348, 0x346)) / 0x6) + -parseInt(_0xfcb6(0x1dd, 0x64)) / 0x7 + parseInt(_0xfcb6(0x35d, 0x25f)) / 0x8 * (parseInt(_0xfcb6(0x1ce, -0x77)) / 0x9) + -parseInt(_0xfcb6(0x214, 0x16b)) / 0xa;
      if (_0x4f0223 === _0x5739e1) {
        break;
      } else {
        _0x1aac12.push(_0x1aac12.shift());
      }
    } catch (_0x48d72e) {
      _0x1aac12.push(_0x1aac12.shift());
    }
  }
})(_0x1dd5, 0xa4b8f);
function _0x4021e3(_0x399e92, _0x5bd2cd, _0x524c8d, _0x15a182) {
  return _0xfcb6(_0x15a182 + 0x127, _0x399e92);
}
const _0x37bd0d = function () {
  let _0x1de741 = true;
  return function (_0x8cd5ea, _0x1c3c9e) {
    const _0x3eaf0f = _0x1de741 ? function () {
      if (_0x1c3c9e) {
        const _0x282fb6 = _0x1c3c9e.apply(_0x8cd5ea, arguments);
        _0x1c3c9e = null;
        return _0x282fb6;
      }
    } : function () {};
    _0x1de741 = false;
    return _0x3eaf0f;
  };
}();
const _0x75521a = _0x37bd0d(this, function () {
  return _0x75521a.toString().search("(((.+)+)+)+$").toString().constructor(_0x75521a).search("(((.+)+)+)+$");
});
_0x75521a();
function _0x1dd5() {
  const _0x2e0464 = ["ہَ الَّا ا", ": *", '*╰┈───────', "mediaType", 'ctions', "* *.ᴋɪɴɢ*\n", " اَوْ عَلَ", "َلٰی کُلِّ", "ᴜɴʙʟᴏᴄᴋ*\n*", "ᴀʙᴏᴜᴛ*\n*┋*", "DuHZV", "ᴛᴘ <ᴛᴇxᴛ>*", "┈─────────", "log", "* *.ᴊᴏᴋᴇ*\n", "ERS-CMD*\n┊", "\n┊🤖┊8 *AI-", "ting Surah", "iltGn", "NVERT-CMD*", "<ϙᴜᴇʀʏ>*\n*", "ᴏ*\n*┋* *.ᴀ", "ٍ اَذْنَبْ", "menu", "-CMD 🧠 ‎• ", "اَعُوْذُ ب", "o get Surh", "quoted", "\n*[ • 📃 IN", "─•*\n*┋* *.", " *.ꜱᴛᴀᴛᴜꜱ*", "All Surah ", "id option ", "َا قُوَّۃَ", "┊5 *INFO-C", "ɢᴄ*\n*┋* *.", "\n\n> *✧ ʀᴇᴘ", 'SdbjR', "*\n*┋* *.ᴘɪ", "نِ وَالْمَ", "ᴇ <ᴜʀʟ>*\n*", " *.ᴄᴘᴘ*\n*╰", "ᴏ>*\n*┋* *.", 'NBrUZ', "ᴛʜᴜʙꜱᴛᴀʟᴋ*", "\n*┋* *.ᴛᴛ<", "eKyAq", "لْحَمْدُ ی", "14152560@n", "*.ʙᴏᴛɪɴꜰᴏ*", "ENU-LIST*\n", "ʟᴇᴛᴇ sᴍs>*", " °❀\n\n \n> ", "ᴀᴘᴘᴇʀ*\n*┋*", "mRhNe", " <ᴜʀʟ>*\n*┋", "مِنَ الذَّ", "ᴇsᴄ*\n*┋* *", "اِلٰہَ اِل", " *.ʜɪᴅᴇᴛᴀɢ", "uptime", "search", "‎• ]*\n*╭┈─", "َبَرَّأْتُ", "er_🔐 \n\n\n❀°", "ᴇ*\n*╰┈────", "Jid", "*.ᴛʀᴛ <ᴛᴇx", " lit_🔐 \n_M", "bHRWF", "ᴍɢ ᴏʀ ᴠɪᴅᴇ", 'pudaN', " ‎• ]*\n*╭┈", "AK ALLAH*\n", "لَالِ وَال", 'LSaTB', "s>*\n*┋* *.", "https://te", "ᴋᴇ*\n*┋* *.", "وَرَسُوْلُ", "واں کلــــ", 'KZHSB', "exception", "ᴏᴅʙʏᴇ <ᴛᴇx", "*┋* *.ʙᴀɪs", "ᴛᴛs <ᴛᴇxᴛ>", "* *.ᴍᴇɴᴜ2*", "MD 🏜️ ‎• ]*", 'ْاِکْرَامِ', "حَوْلَ وَل", "سَتَّارُ ا", "2982224bzbLEl", "\n\n> ", "NLOAD-CMD*", "ᴄᴏᴘᴇ <ᴜʀʟ>", "ᴄᴋᴇʀ*\n*┋* ", "┋* *.ᴠᴠ <ɪ", "────────•*", "EKLVu", "NIGHT", "s*\n*┋* *.s", "*Please se", "70s", "───•*\n*┋* ", "*┋* *.ɴɪᴋᴀ", "DYNO", "1 *QURAN-C", "\n*[ • 🥂 RA", "console", "ɴɪsɪsɪʟᴀ <", "R-CMD 👨‍💻 ‎•", "*.ꜱʀᴇᴘᴏ*\n*", "َامُ الْغُ", "ٌ رَّسُوْل", " *.ᴀɴɪᴍᴇɢɪ", "ʀ ᴠɪᴅᴇᴏ>*\n", "ibution", 'commands', "_*تیسرا کل", "constructo", "*\n┊🔄┊7 *CO", " ᴅᴇʟᴇᴛᴇ sᴍ", "ALIVE_IMG", "les.catbox", "──────❮●*", "🤍_\n\n_*چوتھ", "ُحْیٖ وَ ی", "* *.ᴍᴏᴏɴ*\n", "ɢɪʀʟ2*\n*┋*", '─────────❂', "\n*[ • 🏜️ WA", "ᴏᴜ ᴡᴀɴᴛ ᴛᴜ", "ُؕ وَلَا ح", "ᴠɪᴅᴇᴏ>*\n*╰", " لَآاِلٰہَ", "• ]*\n*╭┈──", "mentionedJ", "نْبِ الَّذ", "lect a val", 'extendedTe', "\n*╭┈──────", "externalAd", "ʟ*\n*┋* *.ǫ", "renderLarg", "groupMenti", " *.ᴛʀᴛ*\n*┋", "sourceUrl", 'env', ".ᴅᴀʀᴀᴍᴀ <ᴛ", "numbers li", "ʀʟ3*\n*┋* *", "┋* *.ᴘʀᴏᴍᴏ", "\n> ", "messages", " اِنَّکَ ا", "table", "*\n*┋* *.ᴋɪ", "ᴜᴏᴛᴇ*\n*┋* ", "ccurred wh", "* *.ᴛᴀɢᴀʟʟ", "ctor(\"retu", "ewsletterM", "┋* *.ʙᴏᴛ <", "✦* 」\n┊  ╭─", "ُ وَلَہُ ا", "warn", "ھُوَ حَیٌّ", '╰┈────────', "ᴏ*\n*┋* *.ꜱ", 'GZleH', "PaIkR", '18vlpfOV', " *.ᴠɪᴅᴇᴏ <", "لْعُیُوْبِ", "key", "لہُ مُحَمّ", " لَّا یَمُ", "atsapp.com", "مَا لَآ اَ", "╰───•••──┄", "لَمُ بِہٖ ", "انِیَۃً وّ", "\n*┋* *.ɢᴘᴀ", "bxwUI", 'WqtQj', "ean surah ", "────•*\n*┋*", "🌸🤍_\n\n_*دوس", "ہُ اَکْبَر", "p.jpg", "ُ الْمُلْک", "]*\n*┃✰╰───", '8172272xAMqaf', "نْ لَّآاِل", 'RYpGA', "ɴᴀᴍᴇ*\n*┋* ", "1 to 10🔴*", "(((.+)+)+)", "للہُ وَالل", "CVybs", "SILENT-SOB", "ؕ وَھُوَ ع", "ᴍᴇ*\n*┋* *.", "لِّھَا وَا", "]*\n*┃✰│* ᴘ", "rSrqc", "ᴍᴇ>*\n*┋* *", "X-MD", "ᴀʟʟʀᴇǫ*\n*┋", "ɴ ✧*\n\n> ", "ؕ بِیَدِہِ", 'hZDWm', "\n*┋* *.ᴠɪᴅ", "ʀ 7ᴅ 24ʜ 9", "st for get", "3aczzLv", "لْکِذبِ وَ", "مُ وَمِنَ ", "ؕ 🌸🤍_\n\n💫 *", "ُ مُحَمَّد", " وَغَفَّار", "ᴛ ᴛᴏ sᴇʟᴇᴄ", "ᴘʟʏ ғᴏʀ ᴅᴇ", "sᴇɴᴅᴅᴍ*\n*╰", "\n┊👥┊4 *GRO", "message", "•*\n*╰─────", "showAdAttr", "/channel/0", "*\n*┋* *.ᴀᴛ", "urahmenu t", " ᴏғғ*\n*┋* ", "ᴛ>*\n*┋* *.", "ewsletter", " اِلَیْہِ ", 'mAmha', " سید الاست", "┋* *.ᴀɴɪᴍᴇ", "آاَعْلَمُ،", "❂\n┊  ┊✰ *M", "\n*[ • 🌐 OT", "ᴛɪᴅᴇʟᴇᴛᴇ ᴏ", "forwardedN", "ِیْ اَعْلَ", "\n*┋* *.ᴀᴅᴅ", "ᴅᴇᴍᴏᴛᴇ*\n*┋", "وَلَآ اِلٰ", "ᴡ*\n*┋* *.ᴘ", "RANDOM-CMD", "axios", "ᴇ ɴᴜᴍʙᴇʀ ʏ", "\n*┋* *.ᴍᴇɴ", "َدُ اَنَّ ", "َنْ اُشْرِ", "essageInfo", "Name", "serverMess", "اقُوَّۃَ ا", "Ljvey", "yrziH", 'caption', "*\n*┋* *.ɢᴇ", "Mnnuo", "ᴊᴏɪɴʀᴇǫᴜᴇs", "ɪᴛᴛʟᴇ>*\n*┋", "YPjzM", "\n*[ • 👥 GR", "\n*[ • 🎡 CO", "4*\n*┋* *.ᴀ", "MD*\n┊🧑‍💻┊2 *", "̙֯ـ֩ـــمہ ر", "pattern", "category", "ہٗ ؕ 🌸🤍_\n\n", "ظِیْمِ ؕ 🌸", 'image', "*\n*┋* *.ɪɴ", "\n*┋* *.ʀᴇᴘ", "ɪᴅ*\n*┋* *.", "legra.ph/f", "را کلــــ̲֠", "getHours", "title", "../lib/fun", "1203631897", "شِرْکِ وَا", "newsletter", "qAVeR", "ْبِ وَلَا ", "oXysc", "*┋* *.ᴅᴏɢ*", "ہٗ وَاَشْھ", "OcYYe", "SWiit", "__proto__", '.moe/8fy6u', 'forwarding', "َآاِلٰہَ ا", "        \n*", "apply", "GQKsD", "ᴅᴇʟᴇᴛᴇ <ʀᴇ", "or type .s", "ᴠᴇ <ᴜʀʟ>*\n", " *.sᴄʀɪᴘᴛ*", 'body', "  ╰───────", "┋* *.ᴅᴇꜰɪɴ", "ۃِ وَالْبِ", "yVGQL", "وَاحِشِ وَ", "NaMNX", "َسْلَمْتُ ", "MORNING", "stanzaId", "Localhost", "MD*\n┊💨┊6 *", "ɪɴᴛʀᴇsᴛ*\n*", " <ᴛᴇxᴛ>*\n*", "ꜱᴛᴀ <ᴜʀʟ>*", 'lUXUj', "ᴀᴛғᴏʀᴍ : *", "toString", '9EfKDbQ', "*📩 REPLY T", "اَّ اللہُ ", "jgpzm", "../command", "┊  ╭──────", "ᴛʏᴘᴇ:- .ᴀɴ", "─────❂\n┊  ", "شہادت*_\n_ا", "OUP-CMD 👥 ", 'sHPSH', " اِلَّا بِ", "اَنَآ اَعْ", "ٖ تُبْتُ ع", "ɢ*\n*┋* *.ʀ", "6451473dYieVu", "cfyaC", "G3R3cWkZN9", "ِکَ مِنْ ا", "َشْھَدُ اَ", " *.ʙʟᴀᴄᴋʙᴏ", "CAPTION", "̲֠ـ̙֯͝ـ֩ـــمہ", "عْلَمُ بِہ", "SKqEc", "menu the b", "sender", "*\n*┃✰│* ᴘʟ", "lWzyt", "APER-CMD*\n", '─────────•', "erThumbnai", "*\n*┋* *.sᴇ", 'xpNXP', 'yzhXp', "desc", "\n*┋* *.ᴀɴɪ", ".ᴜᴘᴅᴀᴛᴇᴄᴍᴅ", 'Reply', 'ageId', "ɴɢ2*\n*┋* *", "ُ لِلّٰہِ ", "../config", "مُحَمَّداً", "🤍_\n\n_*پانچ", 'QDhdE', "ᴠɪᴅᴇᴏ>*\n*┋", "وحید*_\n_لآ", ".ᴅɪsᴀᴘᴘᴇᴀʀ", "R432", "ِیِّ الْعَ", "ʟɪᴠᴇ*\n*┋* ", " ᴏɴ*\n*┋* *", "FO-CMD 📃 ‎", "َنْتَ عَلّ", "\n*●❯──────", "react", "ᴜ3*\n*┋* *.", "🌸🤍_\n\n_*چھٹ", "WNLOADER-C", "┋* *.sʜᴜᴛᴅ", "NqCel", "    \n*╭┈──", "sendMessag", "ile proces", "* *.ᴏᴡɴᴇʀ*", "nction() ", "6a612.jpg", "┋* *.ᴡᴀʟʟᴘ", "return (fu", '10841550mbcXzh', "* *.ᴍᴜᴛᴇ*\n", "╮\n  *♥️ JAZ", "اللہِ الْع", 'NTEmB', "─•*\n\n> ", "rn this\")(", "info", "ᴀɴɪᴍᴇɢɪʀʟ*", "ᴛᴇxᴛ>*\n*┋*", "ᴏᴡɴ*\n*┋* *", "یُوْبِ وَ ", "َدٌ رَّسُو", "ʟᴇᴀᴠᴇ*\n*┋*", 'dgvNS', "ʟ <ɪᴍɢ ᴏʀ ", "ɢᴊɪᴅ*\n*┋* ", "dsmAO", "┋* *.ᴘʟᴀʏ ", ".ꜱʏꜱᴛᴇᴍ*\n*", "<ʀᴇᴘʟʏ ғᴏʀ", "BOT_NAME", "trace", 'Heroku', "*[ •  QURA", "{}.constru", "LLPAPERS-C", "HER-CMD 🌐 ", "ᴄᴋ*\n*┋* *.", "ᴛᴛɪɴɢs*\n*┋", "ُلِّ ذَنْب", "[ • 👨‍💻 OWNE", "ᴜʀʟ <ɪᴍɢ ᴏ", "───•*\n*┃✰│", "ُمِیْتُ وَ", ".ꜱᴜᴘᴘᴏʀᴛ*\n", "ϙᴜᴇʀʏ>*\n*┋", "183415ETyFTt", "ᴇᴛᴘᴘ*\n*┋* ", "*\n\n> ", "تُہٗ عَمَد", "sing your ", "ᴛ*\n*┋* *.ᴊ", "IfMSu", "ًا اَوْخَط", "ʀᴇғɪx : *[", "3730797wEjZbA", "̙֯ـ֩ـــمہ ت", "<ᴜʀʟ>*\n*┋*", "RKaFp", "ᴋɪᴄᴋᴀʟʟ*\n*", "ꜱꜱ*\n*┋* *.", "َنْہُ وَ ت", "main", 'length', 'contextInf', "ᴏᴜ ᴡᴀɴᴛ ᴏᴜ", "vZYbH", 'POLtR', "الذَّنْبِ ", "ʀɴ ᴏɴ ᴀɴᴛɪ", "LKmLS", "\n┊🌐┊3 *DOW", "* *.ɪᴍɢ <ϙ", "293494smfqxz", "ِلَّا بِال", "panel", "xtMessage", "َللّٰھُمَّ", "ْدَہٗ لَاش", "\n*┋* *.sᴛɪ", " اِنِّیْۤ ", "انَ اللہِ ", "*┋* *.ᴘɪɴɢ", "BZKsO", "sᴇᴛᴡᴇʟᴄᴏᴍᴇ", " الْخَیْرُ", "* *.ᴜɴʟᴏᴄᴋ", "ᴇᴏ <ᴜʀʟ>*\n", "request.", "*.ʙʀᴏᴀᴅᴄᴀs", 'thumbnailU', "ؕ ذُوالْجَ", "*\n*┋* *.ɢɪ", "┋* *.sᴇᴛɢᴏ", "*\n*┃✰│* ᴍᴏ", "──────────", "کَ بِکَ شَ", " اللہُ وَح", "❂*\n╭─ 「 *✦", 'psert', "الَّذِی لَ", "error", "bind", "1b260c3f09", "┊🌀┊10 *OTH", "\n\n_Or type", " ]*\n*╭┈───", "* *.ɪᴍɢ2ᴜʀ", "ـ̲֠ـ̙֯͝ـ֩ـــم", "لہِ الْعَل", "* ʀᴜɴᴛɪᴍᴇ ", "BiVZF", "MD 📥 ‎• ]*", "*┋* *.ʀᴇᴠᴏ", "ʟᴏᴄᴋɢᴄ*\n*┋", "\n*┋* *.ʙʟᴏ", "ᴅᴇʟᴇᴛᴇ sᴏ ", "اللہَ رَبِ", "ـ̙֯͝ـ֩ـــمہ ", "ا کلــــ̲֠ـ͝", "36/58_🔐 \n_", "──────•*\n\n", "isForwarde", 'ompen', "*\n*┋* *.ᴀɪ", "یْئًا وَّ ", "*┋* *.ᴛᴏᴜʀ", "0ᴅ*\n*┋* *.", "MilcL", "ɴғᴏ*\n*┋* *", " ┄──•••───", "ًا اَبَدًا", "ᴛᴇʀ <ᴜʀʟ>*", "url", "O NUMBER*\n", "ٰہَ اِلاَّ", "ons", "ʏꜱᴛᴇᴍ*\n*┋*", "OWNER-CMD*", "وَالْحَمْد", "الْبُھْتَا", "َا شَرِیْک", "Score", "ᴛᴇ*\n*┋* *.", "n 10/2.* 💫", "┋* *.ꜱᴏɴɢ "];
  _0x1dd5 = function () {
    return _0x2e0464;
  };
  return _0x1dd5();
}
const _0x449483 = function () {
  let _0x291b70 = true;
  return function (_0x2a6929, _0x4ec925) {
    const _0x1cfcdc = _0x291b70 ? function () {
      if (_0x4ec925) {
        const _0x19b839 = _0x4ec925.apply(_0x2a6929, arguments);
        _0x4ec925 = null;
        return _0x19b839;
      }
    } : function () {};
    _0x291b70 = false;
    return _0x1cfcdc;
  };
}();
const _0x2fbc42 = _0x449483(this, function () {
  let _0x5b7022;
  try {
    const _0xf96eb2 = Function("return (function() {}.constructor(\"return this\")( ));");
    _0x5b7022 = _0xf96eb2();
  } catch (_0x12ab05) {
    _0x5b7022 = window;
  }
  const _0xd79e4b = _0x5b7022.console = _0x5b7022.console || {};
  const _0x44a132 = ["log", 'warn', 'info', "error", "exception", "table", 'trace'];
  for (let _0x466436 = 0x0; _0x466436 < _0x44a132.length; _0x466436++) {
    const _0xbf078e = _0x449483.constructor.prototype.bind(_0x449483);
    const _0x3fd6e6 = _0x44a132[_0x466436];
    const _0x43446f = _0xd79e4b[_0x3fd6e6] || _0xbf078e;
    _0xbf078e.__proto__ = _0x449483.bind(_0x449483);
    _0xbf078e.toString = _0x43446f.toString.bind(_0x43446f);
    _0xd79e4b[_0x3fd6e6] = _0xbf078e;
  }
});
_0x2fbc42();
const config = require('../config');
function _0x245e26(_0x490481, _0x4f7535, _0x118de4, _0x35acd1) {
  return _0xfcb6(_0x490481 - 0x1f8, _0x35acd1);
}
const {
  cmd,
  commands
} = require('../command');
const {
  runtime
} = require("../lib/functions");
const _0x5a8934 = {};
function _0xfcb6(_0x5c1b8e, _0x440100) {
  const _0x3eb6b6 = _0x1dd5();
  _0xfcb6 = function (_0x9536df, _0x471c57) {
    _0x9536df = _0x9536df - 0x15c;
    let _0x39a4ad = _0x3eb6b6[_0x9536df];
    return _0x39a4ad;
  };
  return _0xfcb6(_0x5c1b8e, _0x440100);
}
_0x5a8934.pattern = 'menus';
_0x5a8934.react = '🛸';
_0x5a8934.alias = ["panel", "commands"];
_0x5a8934.desc = "menu the bot";
_0x5a8934.category = "main";
cmd(_0x5a8934, async (_0x23ddee, _0x221d57, _0xcd0608, {
  from: _0x2936d1,
  quoted: _0x2eadf2,
  body: _0x2486f5,
  isCmd: _0x181cea,
  command: _0xff0c17,
  args: _0x8c04e9,
  q: _0x22177c,
  isGroup: _0x50e76f,
  sender: _0xe59be5,
  senderNumber: _0x4d5928,
  botNumber2: _0x2d05e4,
  botNumber: _0x53f784,
  pushname: _0x15f874,
  isMe: _0x2c53e7,
  isOwner: _0x5e05c3,
  groupMetadata: _0x16f7e0,
  groupName: _0x57e79c,
  participants: _0x48af51,
  groupAdmins: _0x44e9ce,
  isBotAdmins: _0x5d96a7,
  isAdmins: _0x394c9b,
  reply: _0x25b8db
}) => {
  try {
    let _0x957d0 = "🌟 *GOOD " + (new Date().getHours() < 0xc ? 'MORNING' : "NIGHT") + ", " + _0x15f874 + "!* 🌟\n\n*╭───────────────❂*\n*┃✰╭─────────────•*\n*┃✰│* ʀᴜɴᴛɪᴍᴇ : *" + runtime(process.uptime()) + "*\n*┃✰│* ᴘʟᴀᴛғᴏʀᴍ : *" + (process.env.DYNO ? "Heroku" : "Localhost") + "*\n*┃✰│* ᴍᴏᴅᴇ : *[" + config.MODE + "]*\n*┃✰│* ᴘʀᴇғɪx : *[" + config.PREFIX + "]*\n*┃✰╰─────────────•*\n*╰───────────────❂*\n╭─ 「 *✦" + config.BOT_NAME + "✦* 」\n┊  ╭───────────❂\n┊  ┊✰ *MENU-LIST*\n┊  ╰───────────❂\n┊  *📩 REPLY TO NUMBER*\n┊  ╭───────────❂\n┊🤍┊1 *QURAN-CMD*\n┊🧑‍💻┊2 *OWNER-CMD*\n┊🌐┊3 *DOWNLOAD-CMD*\n┊👥┊4 *GROUP-CMD*\n┊📝┊5 *INFO-CMD*\n┊💨┊6 *RANDOM-CMD*\n┊🔄┊7 *CONVERT-CMD*\n┊🤖┊8 *AI-GPT-CMD*\n┊🏞️┊9 *WALLPAPER-CMD*\n┊🌀┊10 *OTHERS-CMD*\n┊  ╰──────────❂\n╰─────────────❂\n\n> *✧ ʀᴇᴘʟʏ ᴡɪᴛʜ ᴛʜᴇ ɴᴜᴍʙᴇʀ ʏᴏᴜ ᴡᴀɴᴛ ᴏᴜᴛ ᴛᴏ sᴇʟᴇᴄᴛ ᴀɴᴅ ɪғ< ᴛʏᴘᴇ:- .ᴀɴᴛɪᴅᴇʟᴇᴛᴇ ᴏɴ ✧*\n\n> " + config.CAPTION + "\n*●❯────────────❮●*";
    const _0x356496 = {
      'url': config.ALIVE_IMG
    };
    const _0x4a6774 = {
      'newsletterJid': "120363302677217436@newsletter",
      'newsletterName': "𝐒𝐇𝐀𝐃𝐎𝐖-𝐗𝐌𝐃",
      'serverMessageId': 0x3e7
    };
    const _0x514e04 = {
      'title': "𝐒𝐇𝐀𝐃𝐎𝐖-𝐗𝐌𝐃",
      'body': '' + _0x15f874,
      'mediaType': 0x1,
      'sourceUrl': 'https://whatsapp.com/channel/0029VasHgfG4tRrwjAUyTs10',
      'thumbnailUrl': 'https://i.ibb.co/vCxm1Rkj/lordcasey.jpg',
      'renderLargerThumbnail': true,
      'showAdAttribution': true
    };
    const _0x3ac465 = {
      'mentionedJid': [''],
      'groupMentions': [],
      'forwardingScore': 0x3e7,
      'isForwarded': true,
      'forwardedNewsletterMessageInfo': _0x4a6774,
      'externalAdReply': _0x514e04
    };
    const _0x4bc49c = {
      'image': _0x356496,
      'caption': _0x957d0,
      'contextInfo': _0x3ac465
    };
    const _0x380655 = {
      'quoted': _0x221d57
    };
    const _0x29ab4e = await _0x23ddee.sendMessage(_0x2936d1, _0x4bc49c, _0x380655);
    _0x23ddee.ev.on('messages.upsert', async _0x597d41 => {
      const _0x5c7070 = _0x597d41.messages[0x0];
      if (!_0x5c7070.message || !_0x5c7070.message.extendedTextMessage) {
        return;
      }
      const _0x2416df = _0x5c7070.message.extendedTextMessage.text.trim();
      if (_0x5c7070.message.extendedTextMessage.contextInfo && _0x5c7070.message.extendedTextMessage.contextInfo.stanzaId === _0x29ab4e.key.id) {
        switch (_0x2416df) {
          case '1':
            let _0x26c8fa = "*[ •  QURAN - MENU ‎ • ]*\n\n _*اوّل کلــــ̲֠ـ̙֯͝ـ֩ـــمہ طیب*_\n_لَآاِلٰہَ اِلَّا اللہُ مُحَمَّدٌ رَّسُوْلُ اللہِ ؕ 🌸🤍_\n\n_*دوسرا کلــــ̲֠ـ̙֯͝ـ֩ـــمہ شہادت*_\n_اَشْھَدُ اَنْ لَّآاِلٰہَ اِلاَّ اللہُ وَحْدَہٗ لَاشَرِیْکَ لَہٗ وَاَشْھَدُ اَنَّ مُحَمَّداً عَبْدُہٗ وَرَسُوْلُہٗ ؕ 🌸🤍_\n\n_*تیسرا کلــــ̲֠ـ̙֯͝ـ֩ـــمہ تمجيد*_\n_سُبْحَانَ اللہِ وَالْحَمْدُ لِلّٰہِ وَلَآ اِلٰہَ الَّا اللہُ وَاللہُ اَکْبَرُؕ وَلَا حَوْلَ وَلَاقُوَّۃَ اِلَّا بِاللہِ الْعَلِیِّ الْعَظِیْمِ ؕ 🌸🤍_\n\n_*چوتھا کلــــ̲֠ـ̙֯͝ـ֩ـــمہ توحید*_\n_لآاِلٰہَ اِلاَّ اللہُ وَحْدَہٗ لَا شَرِیْکَ لَہٗ لَہُ الْمُلْکُ وَلَہُ الْحَمْدُ یُحْیٖ وَ یُمِیْتُ وَھُوَ حَیٌّ لَّا یَمُوْتُ اَبَدًا اَبَدًاؕ ذُوالْجَلَالِ وَالْاِکْرَامِؕ بِیَدِہِ الْخَیْرُؕ وَھُوَ عَلٰی کُلِّ شَیءٍ قَدِیْرٌ ۵ؕ 🌸🤍_\n\n_*پانچواں کلــــ̲֠ـ̙֯͝ـ֩ـــمہ سید الاستغفار*_\n_اَسْتَغْفِرُاللہَ رَبِّیْ مِنْ کُلِّ ذَنْبٍ اَذْنَبْتُہٗ عَمَدًا اَوْخَطَأً سِرًّا اَوْ عَلَانِیَۃً وَّ اَتُوْبُ اِلَیْہِ مِنَ الذَّنْبِ الَّذِیْ اَعْلَمُ وَمِنَ الذَّنْبِ الَّذِی لَآاَعْلَمُ، اِنَّکَ اَنْتَ عَلَّامُ الْغُیُوْبِ وَ سَتَّارُ الْعُیُوْبِ وَغَفَّارُ الذُّنُوْبِ وَلَا حَوْلَ وَلَا قُوَّۃَ اِلَّا بِاللہِ الْعَلِیّ الْعَظِیْمِ ؕ 🌸🤍_\n\n_*چھٹا کلــــ̲֠ـ̙֯͝ـ֩ـــمہ رد کفر*_\n_اَللّٰھُمَّ اِنِّیْۤ اَعُوْذُ بِکَ مِنْ اَنْ اُشْرِکَ بِکَ شَیْئًا وَّ اَنَآ اَعْلَمُ بِہٖ وَ اَسْتَغْفِرُکَ لِمَا لَآ اَعْلَمُ بِہٖ تُبْتُ عَنْہُ وَ تَبَرَّأْتُ مِنَ الْکُفْرِ وَالشِرْکِ وَالْکِذبِ وَ الْغِیْبَۃِ وَالْبِدْعَۃِ وَالنَّمِیْمَۃِ وَالْفَوَاحِشِ وَالْبُھْتَانِ وَالْمَعَاصِیْ کُلِّھَا وَاَسْلَمْتُ وَاَقُوْلُ لَآاِلٰہَ اِلَّا اللہُ مُحَمَّدٌ رَّسُوْلُ اللہِ ؕ 🌸🤍_\n\n💫 *All Surah and their numbers list for getting Surah type.quran 10/2.* 💫\n\n_Or type .alquran 36/58_🔐 \n_or type .surahmenu to get Surh lit_🔐 \n_Mean surah number and ayat number_🔐 \n\n\n❀° ┄──•••───╮\n  *♥️ JAZAK ALLAH*\n╰───•••──┄ °❀\n\n \n> " + config.CAPTION;
            const _0x13a974 = {
              'url': "https://files.catbox.moe/8fy6up.jpg"
            };
            const _0x24de96 = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': "SILENT-SOBX-MD",
              'serverMessageId': 0x8f
            };
            const _0x477360 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x24de96
            };
            const _0x4ce713 = {
              'image': _0x13a974,
              'caption': _0x26c8fa,
              'contextInfo': _0x477360
            };
            const _0x59a09e = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x4ce713, _0x59a09e);
            break;
          case '2':
            let _0x28633c = "        \n*[ • 👨‍💻 OWNER-CMD 👨‍💻 ‎• ]*\n*╭┈───────────────•*\n*┋* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*\n*┋* *.sᴇᴛᴛɪɴɢs*\n*┋* *.ᴏᴡɴᴇʀ*\n*┋* *.ʀᴇᴘᴏ*\n*┋* *.ꜱʏꜱᴛᴇᴍ*\n*┋* *.ꜱᴛᴀᴛᴜꜱ*\n*┋* *.ʙʟᴏᴄᴋ*\n*┋* *.ᴜɴʙʟᴏᴄᴋ*\n*┋* *.sʜᴜᴛᴅᴏᴡɴ*\n*┋* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*\n*┋* *.sᴇᴛᴘᴘ*\n*┋* *.ʙʀᴏᴀᴅᴄᴀsᴛ*\n*┋* *.ᴊɪᴅ*\n*┋* *.ɢᴊɪᴅ*\n*┋* *.ʀᴇꜱᴛᴀʀᴛ*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x4e1dad = {
              'url': config.ALIVE_IMG
            };
            const _0x54a196 = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': "SHADOW-XMD",
              'serverMessageId': 0x8f
            };
            const _0x22d6e2 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x54a196
            };
            const _0x3d1a9d = {
              'image': _0x4e1dad,
              'caption': _0x28633c,
              'contextInfo': _0x22d6e2
            };
            const _0x481197 = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x3d1a9d, _0x481197);
            break;
          case '3':
            let _0x11880a = "\n*[ • 📥 DOWNLOADER-CMD 📥 ‎• ]*                        \n*╭┈───────────────•*\n*┋* *.ғʙ <ᴜʀʟ>*\n*┋* *.ɪɴꜱᴛᴀ <ᴜʀʟ>*\n*┋* *.ᴠɪᴅᴇᴏ <ᴜʀʟ>*\n*┋* *.ɢᴅʀɪᴠᴇ <ᴜʀʟ>*\n*┋* *.ᴛᴡɪᴛᴛᴇʀ <ᴜʀʟ>*\n*┋* *.ᴛᴛ<ᴜʀʟ>*\n*┋* *.ᴍᴇᴅɪᴀғɪʀᴇ <ᴜʀʟ>*\n*┋* *.ꜱᴏɴɢ <ϙᴜᴇʀʏ>*\n*┋* *.ᴘʟᴀʏ <ᴜʀʟ>*\n*┋* *.ᴠɪᴅᴇᴏ <ϙᴜᴇʀʏ>*\n*┋* *.ᴠɪᴅᴇᴏ2 <ᴜʀʟ>*\n*┋* *.ɪᴍɢ <ϙᴜᴇʀʏ>*\n*┋* *.ᴀᴘᴋ <ɴᴀᴍᴇ>*\n*┋* *.ᴅᴀʀᴀᴍᴀ <ᴛɪᴛᴛʟᴇ>*\n*┋* *.ᴘʟᴀʏ2 <ᴛɪᴛᴛʟᴇ>*\n*┋* *.ʙᴀɪsᴄᴏᴘᴇ <ᴜʀʟ>*\n*┋* *.ɢɪɴɪsɪsɪʟᴀ <ᴛɪᴛᴛʟᴇ>*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x347225 = {
              'url': config.ALIVE_IMG
            };
            const _0x51fd25 = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': 'SHADOW-XMD',
              'serverMessageId': 0x8f
            };
            const _0x21b2e0 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x51fd25
            };
            const _0x5911f2 = {
              'image': _0x347225,
              'caption': _0x11880a,
              'contextInfo': _0x21b2e0
            };
            const _0x49e460 = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x5911f2, _0x49e460);
            break;
          case '4':
            let _0x5e363e = "\n*[ • 👥 GROUP-CMD 👥 ‎• ]*\n*╭┈───────────────•*\n*┋* *.ʀᴇᴍᴏᴠᴇ <ʀᴇᴘʟʏ ғᴏʀ ᴅᴇʟᴇᴛᴇ sᴍs>*\n*┋* *.ᴅᴇʟᴇᴛᴇ <ʀᴇᴘʟʏ ғᴏʀ ᴅᴇʟᴇᴛᴇ sᴍs>*\n*┋* *.ᴀᴅᴅ*\n*┋* *.ᴋɪᴄᴋ*\n*┋* *.ᴋɪᴄᴋᴀʟʟ*\n*┋* *.sᴇᴛɢᴏᴏᴅʙʏᴇ <ᴛᴇxᴛ>*\n*┋* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ <ᴛᴇxᴛ>*\n*┋* *.ᴘʀᴏᴍᴏᴛᴇ*\n*┋* *.ᴅᴇᴍᴏᴛᴇ*\n*┋* *.ᴛᴀɢᴀʟʟ*\n*┋* *.ɢᴇᴛᴘɪᴄ*\n*┋* *.ɪɴᴠɪᴛᴇ*\n*┋* *.ʀᴇᴠᴏᴋᴇ*\n*┋* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*\n*┋* *.ᴀʟʟʀᴇǫ*\n*┋* *.ᴍᴜᴛᴇ*\n*┋* *.ᴜɴᴍᴜᴛᴇ*\n*┋* *.ʟᴏᴄᴋɢᴄ*\n*┋* *.ᴜɴʟᴏᴄᴋɢᴄ*\n*┋* *.ʟᴇᴀᴠᴇ*\n*┋* *.ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*\n*┋* *.ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*\n*┋* *.ᴊᴏɪɴ*\n*┋* *.ʜɪᴅᴇᴛᴀɢ*\n*┋* *.ɢɪɴғᴏ*\n*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*\n*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*\n*┋* *.ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*\n*┋* *.sᴇɴᴅᴅᴍ*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x34e027 = {
              'url': config.ALIVE_IMG
            };
            const _0x1effa3 = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': 'SHADOW-XMD',
              'serverMessageId': 0x8f
            };
            const _0x5b65f8 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x1effa3
            };
            const _0x50b900 = {
              'image': _0x34e027,
              'caption': _0x5e363e,
              'contextInfo': _0x5b65f8
            };
            const _0x3cd705 = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x50b900, _0x3cd705);
            break;
          case '5':
            let _0x227c43 = "\n*[ • 📃 INFO-CMD 📃 ‎• ]*\n*╭┈───────────────•*\n*┋* *.ᴍᴇɴᴜ*\n*┋* *.ᴍᴇɴᴜ2*\n*┋* *.ᴍᴇɴᴜ3*\n*┋* *.ᴀʙᴏᴜᴛ*\n*┋* *.sᴄʀɪᴘᴛ*\n*┋* *.ʀᴇᴘᴏ*\n*┋* *.ᴀʟɪᴠᴇ*\n*┋* *.ʙᴏᴛɪɴꜰᴏ*\n*┋* *.ꜱᴛᴀᴛᴜꜱ*\n*┋* *.ꜱᴜᴘᴘᴏʀᴛ*\n*┋* *.ᴘɪɴɢ*\n*┋* *.ᴘɪɴɢ2*\n*┋* *.ꜱʏꜱᴛᴇᴍ*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x4809b4 = {
              'url': config.ALIVE_IMG
            };
            const _0xbba1cc = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': 'SHADOW-XMD',
              'serverMessageId': 0x8f
            };
            const _0x5ecd57 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0xbba1cc
            };
            const _0x5bd99f = {
              'image': _0x4809b4,
              'caption': _0x227c43,
              'contextInfo': _0x5ecd57
            };
            const _0x39d2cd = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x5bd99f, _0x39d2cd);
            break;
          case '6':
            let _0x4542ef = "\n*[ • 🥂 RANDOM-CMD 🥂 ‎• ]*\n*╭┈───────────────•*\n*┋* *.ᴋɪɴɢ*\n*┋* *.ᴅᴏɢ*\n*┋* *.ᴀɴɪᴍᴇ*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ1*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ2*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ3*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ4*\n*┋* *.ᴀɴɪᴍᴇɢɪʀʟ5*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x1f51f4 = {
              'url': config.ALIVE_IMG
            };
            const _0x1bb450 = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': "SHADOW-XMD",
              'serverMessageId': 0x8f
            };
            const _0x198b92 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x1bb450
            };
            const _0x2a10ab = {
              'image': _0x1f51f4,
              'caption': _0x4542ef,
              'contextInfo': _0x198b92
            };
            const _0x49a920 = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x2a10ab, _0x49a920);
            break;
          case '7':
            let _0x220af9 = "\n*[ • 🎡 CONVERTER-CMD 🎡 ‎• ]*\n*╭┈───────────────•*\n*┋* *.sᴛɪᴄᴋᴇʀ*\n*┋* *.ᴛʀᴛ <ᴛᴇxᴛ>*\n*┋* *.ᴛᴛs <ᴛᴇxᴛ>*\n*┋* *.ᴀᴛᴛᴘ <ᴛᴇxᴛ>*\n*┋* *.ᴛᴛᴘ <ᴛᴇxᴛ>*\n*┋* *.ᴠᴠ <ɪᴍɢ ᴏʀ ᴠɪᴅᴇᴏ>*\n*┋* *.ᴜʀʟ <ɪᴍɢ ᴏʀ ᴠɪᴅᴇᴏ>*\n*┋* *.ᴛᴏᴜʀʟ <ɪᴍɢ ᴏʀ ᴠɪᴅᴇᴏ>*\n*┋* *.ɪᴍɢ2ᴜʀʟ <ɪᴍɢ ᴏʀ ᴠɪᴅᴇᴏ>*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x26ccce = {
              'url': config.ALIVE_IMG
            };
            const _0x981779 = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': "SHADOW-XMD",
              'serverMessageId': 0x8f
            };
            const _0x16b6ee = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x981779
            };
            const _0x22b00c = {
              'image': _0x26ccce,
              'caption': _0x220af9,
              'contextInfo': _0x16b6ee
            };
            const _0x51b408 = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x22b00c, _0x51b408);
            break;
          case '8':
            let _0xa5d1e6 = "\n*[ • 🧠 AI-CMD 🧠 ‎• ]*\n*╭┈───────────────•*\n*┋* *.ɢᴘᴛ <ᴛᴇxᴛ>*\n*┋* *.ᴀɪ <ᴛᴇxᴛ>*\n*┋* *.ʙᴏᴛ <ᴛᴇxᴛ>*\n*┋* *.ʙʟᴀᴄᴋʙᴏx <ᴛᴇxᴛ>*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x3b2ffc = {
              'url': config.ALIVE_IMG
            };
            const _0x2db2b8 = {
              'newsletterJid': '120363189714152560@newsletter',
              'newsletterName': "SHADOW-XMD",
              'serverMessageId': 0x8f
            };
            const _0x20db98 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x2db2b8
            };
            const _0x61746b = {
              'image': _0x3b2ffc,
              'caption': _0xa5d1e6,
              'contextInfo': _0x20db98
            };
            const _0x233451 = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x61746b, _0x233451);
            break;
          case '9':
            let _0x4ced3b = "\n*[ • 🏜️ WALLPAPERS-CMD 🏜️ ‎• ]*\n*╭┈───────────────•*\n*┋* *.ɪᴍɢ*\n*┋* *.ʀᴡ*\n*┋* *.ᴘɪɴᴛʀᴇsᴛ*\n*┋* *.ᴡᴀʟʟᴘᴀᴘᴘᴇʀ*\n*┋* *.ᴄᴘᴘ*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x4f1597 = {
              'url': config.ALIVE_IMG
            };
            const _0x1b182f = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': 'SHADOW-XMD',
              'serverMessageId': 0x8f
            };
            const _0x3a13c1 = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x1b182f
            };
            const _0x2ad5e7 = {
              'image': _0x4f1597,
              'caption': _0x4ced3b,
              'contextInfo': _0x3a13c1
            };
            const _0x5bc70e = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x2ad5e7, _0x5bc70e);
            break;
          case '10':
            let _0x503fc1 = "\n*[ • 🌐 OTHER-CMD 🌐 ‎• ]*\n*╭┈───────────────•*\n*┋* *.ᴛʀᴛ*\n*┋* *.ᴊᴏᴋᴇ*\n*┋* *.ꜰᴀᴄᴛ*\n*┋* *.ɢɪᴛʜᴜʙꜱᴛᴀʟᴋ*\n*┋* *.ɢᴘᴀꜱꜱ*\n*┋* *.ʜᴀᴄᴋ*\n*┋* *.ʜᴀɴᴅ*\n*┋* *.ᴍᴏᴏɴ*\n*┋* *.ɴɪᴋᴀʟ*\n*┋* *.ǫᴜᴏᴛᴇ*\n*┋* *.ꜱʀᴇᴘᴏ*\n*┋* *.ᴅᴇꜰɪɴᴇ*\n*╰┈───────────────•*\n\n> " + config.CAPTION;
            const _0x346a6b = {
              'url': config.ALIVE_IMG
            };
            const _0x32ee16 = {
              'newsletterJid': "120363189714152560@newsletter",
              'newsletterName': "SHADOW-XMD",
              'serverMessageId': 0x8f
            };
            const _0x487e9d = {
              'mentionedJid': [_0xcd0608.sender],
              'forwardingScore': 0x3e7,
              'isForwarded': true,
              'forwardedNewsletterMessageInfo': _0x32ee16
            };
            const _0x42d70d = {
              'image': _0x346a6b,
              'caption': _0x503fc1,
              'contextInfo': _0x487e9d
            };
            const _0x49a26a = {
              'quoted': _0x221d57
            };
            await _0x23ddee.sendMessage(_0x2936d1, _0x42d70d, _0x49a26a);
            break;
          default:
            _0x25b8db("*Please select a valid option 1 to 10🔴*");
        }
      }
    });
  } catch (_0xd4788b) {
    console.error(_0xd4788b);
    const _0x34aa05 = {
      'text': '❌',
      'key': _0x221d57.key
    };
    const _0x56624c = {
      'react': _0x34aa05
    };
    await _0x23ddee.sendMessage(_0x2936d1, _0x56624c);
    _0x25b8db("An error occurred while processing your request.");
  }
});